---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle
source: html/927357e1-9874-8b73-72c8-ff2bb78bfa82.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle

Exposes API for manipulation of analysis display style.

## Syntax (C#)
```csharp
public class AnalysisDisplayStyle : Element
```